/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hkyong <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/08/04 15:38:39 by hkyong            #+#    #+#             */
/*   Updated: 2019/08/04 18:07:50 by hkyong           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

void	rush(int x, int y);

int		main(void)
{
	rush(232, 45);
	return (0);
}
// здесь тупо вызываем в мейне функцию раш и загоняем туда тестовые значения