/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hkyong <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/08/04 15:41:18 by hkyong            #+#    #+#             */
/*   Updated: 2019/08/04 15:41:20 by hkyong           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}
/* здесь описываем путчар, где:
запиливаем по адлресу С (ФД = 1 (вывод) и придаем размер 1 байта) то есть, выводим 1 байт из С
*/