/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   rush01.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hkyong <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/08/04 19:31:53 by hkyong            #+#    #+#             */
/*   Updated: 2019/08/04 19:31:54 by hkyong           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

void	ft_putchar(char c);

void	ft_print_elem(int x1, int y1, int x, int y)
{
	if ((x1 == 1 && y1 == 1) || (x1 == x && y1 == y && y != 1 && x != 1)) // понять, зачем !=
		ft_putchar('/');
	else if ((x1 == x && y1 == 1) || (x1 == 1 && y1 == y))
		ft_putchar('\\'); // верно ли определен слеш? сейчас видно, что он двойной, в то время, как в задании он одинарный в правом верхрнем и левом нижнем углах.
	else if (y1 == 1 || y1 == y || x1 == 1 || x1 == x) // ощущение, что здесь мы ставим все, что не описано выше, но почему именно вот так? понять.
		ft_putchar('*');
	else
		ft_putchar(' '); // все, что не описано условиями - пустота.
}

void	rush(int x, int y)
{
	int x1;
	int y1;

	x1 = 1;
	y1 = 1;
	if (x > 0 && y > 0)
	{
		while (y1 <= y)
		{
			while (x1 <= x)
			{
				ft_print_elem(x1, y1, x, y);
				x1 = x1 + 1;
			}
			y1 = y1 + 1;
			ft_putchar('\n');
			x1 = 1;
		}
	}
}
